//**************************ARRAYS
// Methods:

// Добавление / удаление:
// 1. arr.push(...items) - доб эл-ты в конец
// 2. arr.pop() - извлекает эл-т из конца
// 3. arr.shift() - извлекает эл-т из начала
// 4. arr.unshift(...items) - доб эл-т в начало

// Перебирающие методы:
// 1. forEach - для перебора массива
// 2. filter - для фильтрации массива
// 3. every / some - для проверки массива
// 4. map - для трансформации массива в массив
// 5. reduce / reduceRight - для прохода по массиву с вычислением значения

// Преобразование массива:
// 1. arr.map - вызывает ф-ю для каждого эл-та массива и возвращает массив результатов выполнения этой ф-ии.
// 2. sort(fn) - сортирует массив на месте, меняя в нём порядок эл-ов.
// 3. arr.reverse - меняет порядок в arr эл-ов на обратный
// 4. str.split(delim) - разбивает строку на массив по заданному разделителю
// 5. arr.join(glue) -создаёт строку из элементов arr, встявляя glue м/у ними
// 6. reduce - исп
// 7. reduceRight

// Другие:
// 1. splice - удаляет эл-т из массива
// arr.splice(start[, deleteCount, elem1, ..., elemN])
// let arr = ["Я", "изучаю", "JavaScript"];
// arr.splice(1, 1); // начиная с индекса 1, удалить 1 элемент
// 2. slice - возвращ новый массив, копируя все эл-ты с индекса start до end
// arr.slice([start], [end])
// 3. concat - создаёт новый массив, в кот копирует данные из других массивов в доп значения.
// arr.concat(arg1, arg2...)
// 4. indexOf / lastIndexOf / includes
// 5. find / findIndex / findLastIndex

// Array/isArray